#encoding: utf-8
from __future__ import unicode_literals
import re
Small = {
    u'صفر': 0,
    u'یک': 1,
    u'دو': 2,
    u'سه': 3,
    u'چهار': 4,
    u'پنج': 5,
    u'شش': 6,
    u'شیش': 6,
    u'هفت': 7,
    u'هشت': 8,
    u'نه': 9,
    u'ده': 10,
    u'یازده': 11,
    u'دوازده': 12,
    u'سیزده': 13,
    u'چهارده': 14,
    u'پانزده': 15,
    u'شانزده': 16,
    u'هفده': 17,
    u'هجده': 18,
    u'نوزده': 19,
    u'بیست': 20,
    u'سی': 30,
    u'چهل': 40,
    u'پنجاه': 50,
    u'شصت': 60,
    u'هفتاد': 70,
    u'هشتاد': 80,
    u'نود': 90,
    u'صد': 100,
    u'یکصد': 100,
    u'دویست': 200,
    u'سیصد': 300,
    u'چهارصد': 400,
    u'پانصد': 500,
    u'پونصد': 500,
    u'ششصد': 600,
    u'شیشصد': 600,
    u'هفتصد': 700,
    u'هفصد': 700,
    u'هشتصد': 800,
    u'نهصد': 900,
    u'هزار': 1000,
}
 
Magnitude = {
    u'صد':    100,
    u'هزار':     1000,
    u'میلیون':      1000000,
    u'میلیارد':      1000000000,
    u'بیلیون':     1000000000000,
    u'بیلیارد':  1000000000000000,
    u'تریلیون':  1000000000000000000,
    u'تریلیارد':   1000000000000000000000,
    u'کوادریلیون':   1000000000000000000000000,
    u'کادریلیارد':    1000000000000000000000000000,
    u'کوینتیلیون':    1000000000000000000000000000000
}

DIGITS_WORD = [
    " صفر " ,
    " یک " ,
    " دو " ,
    " سه " ,
    " چهار " ,
    " پنج " ,
    " شش " ,
    " هفت " ,
    " هشت " ,
    " نه " 
]
TENS = [
    " " ,
    " ده " ,
    " بیست " ,
    " سی " ,
    " چهل " ,
    " پنجاه " ,
    " شصت " ,
    " هفتاد " ,
    " هشتاد " ,
    " نود" 
]
HUNDREDS = [
    " " ,
    " یکصد " ,
    " دویست " ,
    " سیصد " ,
    " چهارصد " ,
    " پانصد " ,
    " ششصد " ,
    " هفتصد " ,
    " هشتصد " ,
    " نهصد " 
]
TEENS = [
    " ده " ,
    " یازده " ,
    " دوازده " ,
    " سیزده " ,
    " چهارده " ,
    " پانزده " ,
    " شانزده " ,
    " هفده " ,
    " هیجده " ,
    " نوزده " 
]
POWERS_OF_THOUSAND = [
    " " ,
    " هزار " ,
    " میلیون " ,
    " میلیارد " ,
    " بیلیون " ,
    " بیلیارد " ,
    " تریلیون " ,
    " تریلیارد " ,
    " کوادریلیون " ,
    " کادریلیارد " ,
    " کوینتیلیون ",
] # from: https://fa.wikipedia.org/wiki/نام_اعداد_بزرگ

IRREG_ORD_NUMS = {
    '0' : " صفرم ",
    '1': "اول",
    '3' : " سوم " ,
    '30' : " سی ام ",
}

IRREG_ORD_REGEXES = {    
    re.compile(r"^(\d+)(30)$"): [r"\g<1>00", "30"],
    re.compile(r"^(\d+)(3)$"): [r"\g<1>0", "3"],
}

AND = " و " 
MIM = " م " 
ALEF_MIM = " ام " 
NEG = " منفی "
Ignore = ['و']
