# encoding: utf-8
from __future__ import unicode_literals
import re

Small = {
    "صفر": 0,
    "یک": 1,
    "دو": 2,
    "سه": 3,
    "چهار": 4,
    "پنج": 5,
    "شش": 6,
    "شیش": 6,
    "هفت": 7,
    "هشت": 8,
    "نه": 9,
    "ده": 10,
    "یازده": 11,
    "دوازده": 12,
    "سیزده": 13,
    "چهارده": 14,
    "پانزده": 15,
    "شانزده": 16,
    "هفده": 17,
    "هجده": 18,
    "نوزده": 19,
    "بیست": 20,
    "سی": 30,
    "چهل": 40,
    "پنجاه": 50,
    "شصت": 60,
    "هفتاد": 70,
    "هشتاد": 80,
    "نود": 90,
    "صد": 100,
    "یکصد": 100,
    "دویست": 200,
    "سیصد": 300,
    "چهارصد": 400,
    "پانصد": 500,
    "پونصد": 500,
    "ششصد": 600,
    "شیشصد": 600,
    "هفتصد": 700,
    "هفصد": 700,
    "هشتصد": 800,
    "نهصد": 900,
    "هزار": 1000,
}

Magnitude = {
    "صد": 100,
    "هزار": 1000,
    "میلیون": 1000000,
    "میلیارد": 1000000000,
    "بیلیون": 1000000000000,
    "بیلیارد": 1000000000000000,
    "تریلیون": 1000000000000000000,
    "تریلیارد": 1000000000000000000000,
    "کوادریلیون": 1000000000000000000000000,
    "کادریلیارد": 1000000000000000000000000000,
    "کوینتیلیون": 1000000000000000000000000000000,
}

DIGITS_WORD = [
    " صفر ",
    " یک ",
    " دو ",
    " سه ",
    " چهار ",
    " پنج ",
    " شش ",
    " هفت ",
    " هشت ",
    " نه ",
]
TENS = [
    " ",
    " ده ",
    " بیست ",
    " سی ",
    " چهل ",
    " پنجاه ",
    " شصت ",
    " هفتاد ",
    " هشتاد ",
    " نود",
]
HUNDREDS = [
    " ",
    " یکصد ",
    " دویست ",
    " سیصد ",
    " چهارصد ",
    " پانصد ",
    " ششصد ",
    " هفتصد ",
    " هشتصد ",
    " نهصد ",
]
TEENS = [
    " ده ",
    " یازده ",
    " دوازده ",
    " سیزده ",
    " چهارده ",
    " پانزده ",
    " شانزده ",
    " هفده ",
    " هیجده ",
    " نوزده ",
]
POWERS_OF_THOUSAND = [
    " ",
    " هزار ",
    " میلیون ",
    " میلیارد ",
    " بیلیون ",
    " بیلیارد ",
    " تریلیون ",
    " تریلیارد ",
    " کوادریلیون ",
    " کادریلیارد ",
    " کوینتیلیون ",
]  # from: https://fa.wikipedia.org/wiki/نام_اعداد_بزرگ

IRREG_ORD_NUMS = {
    "0": " صفرم ",
    "1": "اول",
    "3": " سوم ",
    "30": " سی ام ",
}

IRREG_ORD_REGEXES = {
    re.compile(r"^(\d+)(30)$"): [r"\g<1>00", "30"],
    re.compile(r"^(\d+)(3)$"): [r"\g<1>0", "3"],
}

AND = " و "
MIM = " م "
ALEF_MIM = " ام "
NEG = " منفی "
Ignore = ["و"]
